app/controllers/users_controller.rb

  def signup
    hasura_id = params[:hasura_id]
    email = params[:data][:email]
    password = params[:data][:password]
    user = User.new(email: email, password: password, hasura_id: hasura_id)
    if user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "tiru"], ["password_digest", "$2a$10$dU18AXT/V65Oajk4vvHqTu9G.znVG4CmSVKSjsjJCU6u8x4zl6whq"], ["created_at", 2017-09-01 09:20:44 UTC], ["updated_at", 2017-09-01 09:20:44 UTC]]

  def merge
    old_hasura_id = params[:old_hasura_id]
    new_hasura_id = params[:new_hasura_id]
    user = User.find_by(hasura_id: old_hasura_id)
    user.hasura_id = new_hasura_id
    if user.save(validate:false)
      render json: {success: true}
    else
      render json: { code: "bad_request", message: user.errors.full_messages.join(";") }, status: 400
---
SELECT  "users".* FROM "users" WHERE "users"."hasura_id" = ? LIMIT ?  [["hasura_id", 52], ["LIMIT", 1]]
UPDATE "users" SET "hasura_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["hasura_id", 59], ["updated_at", 2017-09-01 14:30:10 UTC], ["id", 8]]
SELECT "users".* FROM "users"